
Feature: Изтриване на коментари од гледна точка на роли

   Scenario: Успешно изтриване на коментара от Администратор
    Given Отворете полето за изтриване на коментари
    When Посочете потребителско име: "Енес"
    And Посочете заглавието на коментара: "играчка"
    And Щракнете върху бутона за изтриване
    Then Показване на съобщение: "Коментарът е изтрит успешно!"

    Scenario: Коментарът не е изтрит, тъй като потребителят не съществува
    Given Отворете полето за изтриване на коментари
    When Посочете потребителско име: "Мехо"
    And Посочете заглавието на коментара: "кола в стабилно здраве"
    And Щракнете върху бутона за изтриване
    Then Показване на съобщение: "потребител не съществува!"
    
    Scenario: Изтриването на коментари не бе успешно поради потребителска роля
    Given Отворете полето за изтриване на коментари
    When Посочете потребителско име: "Селмин"
    And Посочете заглавието на коментара: "програмист"
    And Щракнете върху бутона за изтриване
    Then Показване на съобщение: "коментар може да бъде изтрит само от администратор!"
    