Feature: Публикуване на като не се допуска коментар без съдържание

Background: 
		Given отваря полето за коментари
 
  Scenario: регистиран потребителят иска да напише коментар
    
    And  потребител e регистриран "User" 
    And напише нешто "Wow"
    When натисне бутона за публиковане на тема
    Then вижда сьобштение за успех "Успешно публикувахте тема!"
    
  Scenario: не регистиран потребителят иска да напише коментар
    And  потребител e не регистриран "Anonymous"
    And напише нешто "Wow"
    When натисне бутона за публиковане на тема
    Then вижда сьобштение за неуспех "Не можете да публикувате тема!"
    
   Scenario: иска да публикува тема без съдържание
    And  потребител e регистриран "User"
    And не напише ништо 
    When натисне бутона за публиковане на тема
    Then вижда сьобштение "тема без заглавие не е позволенa!"
    
  Scenario: потребителят иска да публикува коментар от една буква
    And  потребител e регистриран "User"
    And напише обиден коментар "S"
    When натисне бутона за публиковане на тема
    Then вижда сьобштение за неуспех "коментар с една буква не е позволен!"
      
  